simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
#ifndef CAL_ADC_DIRECT_CONVERSION_MS
/* El ADC DelSig entrega a 2604 Sa/s en la configuracion de calibracion. La
 * ISR de la ruta filtrada tambien lee el status de fin de conversion, por lo
 * que hacer polling de ADC_IsEndConversion(RETURN_STATUS) desde foreground
 * tiene una carrera: la ISR puede consumir todos los flags y el viejo helper
 * terminaba devolviendo un cero inventado. El Delta-Sigma conserva memoria
 * de su propio filtro decimador al cambiar AMux: 2 ms alcanzaban para obtener
 * un dato nuevo, pero no uno asentado (el error era especialmente visible al
 * pasar de SUM a LP). Treinta milisegundos dejan unas 78 conversiones reales
 * y solo agregan ~120 ms al precheck completo de cuatro etapas. */
#define CAL_ADC_DIRECT_CONVERSION_MS 30u
#endif

/* El servo de offset necesita el valor DC del tap, no la ruta DMA/DFB que se
 * reconfigura al entrar y salir de adquisicion. En banco el ADC directo dio
 * medidas repetibles, mientras el ultimo valor del DFB podia corresponder al
 * transitorio de la ruta anterior y cerraba falsamente cerca del target. */
#ifndef CAL_PI_USE_DIRECT_ADC
#define CAL_PI_USE_DIRECT_ADC 1u
#endif

static int32 cal_adc_read_direct_counts(void)
{
    int32 sample;

    ADC_StopConvert();
    ADC_StartConvert();
    CyDelay(CAL_ADC_DIRECT_CONVERSION_MS);
    sample = ADC_GetResult32();
    ADC_StopConvert();

    return psoc_adc_counts_right_aligned(sample);
}

static uint8 cal_pi_take_control_sample(int32 *sample)
{
#if CAL_PI_USE_DIRECT_ADC
    if (sample == (int32 *)0) {
        return 0u;
    }
    *sample = cal_adc_read_direct_counts();
    return 1u;
#else
    return psoc_adc_take_isr_filtered_sample(sample);
#endif
}

static int32 cal_pi_compare_counts(int32 measured)
{
#if PSOC_HW_CLASS == PSOC_HW_HAMMER
    return abs_counts(measured);
#else
    /* Los taps GEO descansan fisicamente sobre Vref ~= 1 V; el cero que se
     * calibra es la componente diferencial alrededor de ese modo comun. El
     * ADC entrega el nivel absoluto (unas 52429 cuentas/V en CF_2V5), por lo
     * que centrar aqui mantiene los targets de las tablas expresados en el
     * dominio correcto: 0 counts == tap exactamente en Vref. La telemetria
     * conserva `measured` crudo y expone `cmp` ya centrado. */
    return measured - CAL_TARGET_1V_COUNTS;
#endif
}

#if CAL_DIAG_SWEEP_ENABLE
static void cal_diag_sweep_stage(const PsocCalStage *stage)
{
    /* Los tres puntos del barrido de diagnostico ahora recorren el rango con
     * signo: un extremo, el centro (que es Vref) y el otro extremo. */
    static const int16 sweep_dac[3] = { -PSOC_IDAC_SIGNED_MAX, 0, PSOC_IDAC_SIGNED_MAX };
    uint8 i;

    for (i = 0u; i < 3u; i++) {
        stage->write(sweep_dac[i]);
        CyDelay(CAL_DIAG_SWEEP_SETTLE_MS);
        cal_diag_i16(PSOC_EVT_CAL_SWEEP_DAC, (int32)sweep_dac[i]);
        cal_diag_i32(PSOC_EVT_CAL_SWEEP_MEAS32, cal_adc_read_direct_counts());
    }
}
#endif

/* Rango de la etapa, EN CODIGOS CON SIGNO. El piso puede ser negativo: con
 * dac_center = 0 y dac_max_change = 255 el rango es -255..+255, que es todo el
 * punto de haber cableado polarity_reg. Con la version sin signo el piso daba 0
 * y la mitad negativa quedaba muerta sin que nada lo dijera. */
static int16 cal_stage_min_dac(const PsocCalStage *stage)
{
    int32 lo = (int32)stage->dac_center - (int32)stage->dac_max_change;

    if (lo < -(int32)PSOC_IDAC_SIGNED_MAX) {
        lo = -(int32)PSOC_IDAC_SIGNED_MAX;
    }
    return (int16)lo;
}

static int16 cal_stage_max_dac(const PsocCalStage *stage)
{
    int32 hi = (int32)stage->dac_center + (int32)stage->dac_max_change;

    if (hi > (int32)PSOC_IDAC_SIGNED_MAX) {
        hi = (int32)PSOC_IDAC_SIGNED_MAX;
    }
    return (int16)hi;
}

static int16 cal_stage_clamp_dac(const PsocCalStage *stage, int16 dac)
{
    int16 lo = cal_stage_min_dac(stage);
    int16 hi = cal_stage_max_dac(stage);

    if (dac < lo) { return lo; }
    if (dac > hi) { return hi; }
    return dac;
}

static int16 cal_stage_center_dac(const PsocCalStage *stage)
{
    return cal_stage_clamp_dac(stage, stage->dac_center);
}

PsocCalResult g_psoc_cal_results[PSOC_CAL_MAX_STAGES];
uint8 g_psoc_cal_result_count = 0u;

#define CAL_ASYNC_EMPTY_POLL_LIMIT 2000000UL

/* Watchdog global expresado como ticks legacy de 10 ms para mantener la escala
 * de configuracion anterior; en runtime lo ejecuta Timer_3 como one-shot. */
#ifndef CAL_WATCHDOG_TICKS
#define CAL_WATCHDOG_TICKS 40000UL
#endif

/* Periodo de telemetria de progreso (ticks legacy de 10 ms => ~500 ms). */
#define CAL_PROGRESS_PERIOD_TICKS 50UL
#define CAL_LEGACY_TICK_MS 10UL
#define CAL_WATCHDOG_MS (CAL_WATCHDOG_TICKS * CAL_LEGACY_TICK_MS)
#define CAL_PROGRESS_PERIOD_MS (CAL_PROGRESS_PERIOD_TICKS * CAL_LEGACY_TICK_MS)

/* Muestras del PI que se envian al ESP durante calibracion. No puede ser cada
 * muestra a 3 kHz: cada valor int32 viaja como 4 eventos UART. */
#ifndef CAL_PI_TELEM_PERIOD
#define CAL_PI_TELEM_PERIOD 256u
#endif

#ifndef CAL_PI_HAMMER_PASS_COUNT
#define CAL_PI_HAMMER_PASS_COUNT 1u
#endif

#if PSOC_HW_CLASS == PSOC_HW_HAMMER
#define CAL_PI_PASS_COUNT CAL_PI_HAMMER_PASS_COUNT
#else
#define CAL_PI_PASS_COUNT 1u
#endif

#ifndef CAL_DIAG_SWEEP_ENABLE
#define CAL_DIAG_SWEEP_ENABLE 0u
#endif

#ifndef CAL_DIAG_SWEEP_SETTLE_MS
#define CAL_DIAG_SWEEP_SETTLE_MS 30u
#endif

typedef enum {
    CAL_ASYNC_IDLE = 0u,
    CAL_ASYNC_DONE
} PsocCalAsyncState;

typedef struct {
    PsocCalAsyncState state;
    uint8 busy;
    uint8 done;
    uint8 ok;
    uint8 stage_index;
    uint8 pass_index;
} PsocCalAsync;

static PsocCalAsync g_cal_async = { CAL_ASYNC_IDLE };




static int16 cal_stage_current_dac(uint8 stage_index)
{
    if (stage_index >= g_psoc_cal_result_count) {
        return cal_stage_center_dac(&g_psoc_cal_stages[stage_index]);
    }
    return cal_stage_clamp_dac(&g_psoc_cal_stages[stage_index],
                               g_psoc_cal_results[stage_index].final_dac);
}

static void cal_stage_write_result(uint8 stage_index, int16 dac)
{
    if (stage_index < PSOC_CAL_STAGE_COUNT) {
        int16 clamped = cal_stage_clamp_dac(&g_psoc_cal_stages[stage_index], dac);
        g_psoc_cal_stages[stage_index].write(clamped);
        g_psoc_cal_results[stage_index].final_dac = clamped;
        if (g_psoc_cal_result_count < PSOC_CAL_STAGE_COUNT) {
            g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;
        }
    }
}

