simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
typedef enum {
    CAL_PI_STAGE_BEGIN = 0u,
    CAL_PI_SETTLE,
    CAL_PI_RUN,
    CAL_PI_REFINE_SETTLE
} PsocCalPiState;

typedef struct {
    int32 kp_num;
    int32 kp_div;
    int32 ki_num;
    int32 ki_div;
    int32 gain_x1000;       /* ganancia fija VDAC->medida; 0 = dinamica por etapa */
    int32 deadband_counts;  /* banda fisica del tap, en counts del ADC */
    uint16 lock_samples;    /* M muestras en la misma celda de error */
    /* POR QUE ESTOS TRES SON uint32 Y NO uint16
     * La planta tarda tau ~ 31 s en asentarse (R4*C1 = 43k x 680 uF = 29,2 s
     * del esquematico, 31,3 s medidos el 2026-09-03). A 2604 Hz, 5 tau son
     * 407.526 muestras. En uint16 el techo es 65.535 = 25,2 s: no entra ni UN
     * tau. Y el modo de falla es el peor posible, porque no avisa: 407.526
     * truncado a 16 bits da 14.310 muestras = 5,5 s. Compila limpio, corre, y
     * espera veintiocho veces menos de lo pedido. */
    uint32 settle_samples;  /* espera del FIR al cambiar AMux/VDAC: 128 muestras */
    uint32 plant_settle_samples; /* espera de la PLANTA, ver abajo */
    uint32 timeout_samples; /* techo de muestras de PI para esta etapa */
    uint8 refine_enable;    /* prueba final de +/-1 codigo VDAC */
    uint32 refine_settle_samples;
} PsocCalPiCfg;

/* SETTLE vs PLANT_SETTLE: son dos esperas distintas que estaban colapsadas en
 * una sola constante, y esa confusion es la causa de fondo del problema.
 *
 *   settle_samples       vacia el FIR. Son exactamente FILTER_FIR_NTAPS = 128
 *                        muestras (49 ms), porque el filtro tiene ganancia DC
 *                        uno y ese es el tiempo que tarda su ventana en
 *                        contener solo muestras posteriores al cambio. Este
 *                        numero SIEMPRE estuvo bien.
 *
 *   plant_settle_samples espera a que la CADENA ANALOGICA se asiente despues de
 *                        que una etapa de aguas arriba movio su referencia. Es
 *                        un multiplo de tau, del orden de 10^5 muestras. Este
 *                        numero NO EXISTIA: no es que estuviera mal calculado,
 *                        es que el concepto faltaba.
 *
 * Sin el segundo, cada etapa medía su tap mientras todavía se movía por lo que
 * acababa de hacer la anterior, y el lazo anulaba perfectamente un valor
 * equivocado. De ahi los tres sintomas: oscila, el watchdog aborta, y lo que
 * consigue no se sostiene. */

typedef struct {
    PsocCalPiState state;
    int32 integral;
    int32 last_fir_output;
    int32 last_error_dac;
    int32 last_error_bucket;
    /* uint32 por el mismo motivo que en PsocCalPiCfg: con la espera de planta
     * estos contadores pasan de 10^5, y en uint16 daban la vuelta en silencio. */
    uint32 samples_taken;
    uint16 stable_count;
    uint32 settle_remaining;
    uint32 control_hold_remaining; /* memoria FIR pendiente tras mover el DAC */
    int32 refine_base_measured;
    int32 refine_base_abs_error;
    int16 refine_base_dac;
    int16 refine_trial_dac;
    uint8 refine_ok;
    uint8 have_last_error;
    int16 last_dac_target;
    int16 base_dac;
    int16 dac_current;
    uint32 empty_polls;
} PsocCalPi;

static PsocCalPi g_cal_pi;

/* Division entera con redondeo al mas cercano (no truncado hacia 0). */
static int32 cal_round_div_i64(int64 num, int64 den)
{
    int64 half;

    if (den == 0LL) {
        den = 1LL;
    }
    half = (den < 0LL) ? -den / 2LL : den / 2LL;
    if ((num < 0LL) != (den < 0LL)) {
        return (num - half) / den;
    }
    return (num + half) / den;
}

static int32 cal_pi_clip_integral(int32 value)
{
    if (value > CAL_PI_INTEGRAL_LIMIT) { return CAL_PI_INTEGRAL_LIMIT; }
    if (value < -CAL_PI_INTEGRAL_LIMIT) { return -CAL_PI_INTEGRAL_LIMIT; }
    return value;
}

#if PSOC_HW_CLASS == PSOC_HW_GEO
static const PsocCalPiCfg g_cal_pi_cfg[PSOC_CAL_STAGE_COUNT] = {
    { CAL_PI_KP_NUM_GEO_PGA, CAL_PI_KP_DIV_GEO_PGA, CAL_PI_KI_NUM_GEO_PGA, CAL_PI_KI_DIV_GEO_PGA, CAL_PI_GAIN_GEO_PGA_X1000, CAL_PI_DEADBAND_GEO_PGA_1X_COUNTS, CAL_PI_LOCK_SAMPLES_GEO_PGA, CAL_PI_SETTLE_SAMPLES_GEO_PGA, CAL_PI_PLANT_SETTLE_SAMPLES_GEO_PGA, CAL_PI_TIMEOUT_SAMPLES_GEO_PGA, CAL_PI_REFINE_ENABLE_GEO_PGA, CAL_PI_REFINE_SETTLE_SAMPLES_GEO_PGA },
#if defined(VDAC_ref_BP_DEFAULT_DATA) || defined(CY_DVDAC_VDAC_ref_BP_H)
    { CAL_PI_KP_NUM_GEO_BP, CAL_PI_KP_DIV_GEO_BP, CAL_PI_KI_NUM_GEO_BP, CAL_PI_KI_DIV_GEO_BP, CAL_PI_GAIN_GEO_BP_X1000, CAL_PI_DEADBAND_GEO_BP_COUNTS, CAL_PI_LOCK_SAMPLES_GEO_BP, CAL_PI_SETTLE_SAMPLES_GEO_BP, CAL_PI_PLANT_SETTLE_SAMPLES_GEO_BP, CAL_PI_TIMEOUT_SAMPLES_GEO_BP, CAL_PI_REFINE_ENABLE_GEO_BP, CAL_PI_REFINE_SETTLE_SAMPLES_GEO_BP },
#endif
    { CAL_PI_KP_NUM_GEO_SUM, CAL_PI_KP_DIV_GEO_SUM, CAL_PI_KI_NUM_GEO_SUM, CAL_PI_KI_DIV_GEO_SUM, CAL_PI_GAIN_GEO_SUM_X1000, CAL_PI_DEADBAND_GEO_SUM_COUNTS, CAL_PI_LOCK_SAMPLES_GEO_SUM, CAL_PI_SETTLE_SAMPLES_GEO_SUM, CAL_PI_PLANT_SETTLE_SAMPLES_GEO_SUM, CAL_PI_TIMEOUT_SAMPLES_GEO_SUM, CAL_PI_REFINE_ENABLE_GEO_SUM, CAL_PI_REFINE_SETTLE_SAMPLES_GEO_SUM },
    { CAL_PI_KP_NUM_GEO_LP, CAL_PI_KP_DIV_GEO_LP, CAL_PI_KI_NUM_GEO_LP, CAL_PI_KI_DIV_GEO_LP, CAL_PI_GAIN_GEO_LP_X1000, CAL_PI_DEADBAND_GEO_LP_COUNTS, CAL_PI_LOCK_SAMPLES_GEO_LP, CAL_PI_SETTLE_SAMPLES_GEO_LP, CAL_PI_PLANT_SETTLE_SAMPLES_GEO_LP, CAL_PI_TIMEOUT_SAMPLES_GEO_LP, CAL_PI_REFINE_ENABLE_GEO_LP, CAL_PI_REFINE_SETTLE_SAMPLES_GEO_LP },
};
#else
static const PsocCalPiCfg g_cal_pi_cfg[PSOC_CAL_STAGE_COUNT] = {
    { CAL_PI_KP_NUM_HAMMER_PGA, CAL_PI_KP_DIV_HAMMER_PGA, CAL_PI_KI_NUM_HAMMER_PGA, CAL_PI_KI_DIV_HAMMER_PGA, CAL_PI_GAIN_HAMMER_PGA_X1000, CAL_PI_DEADBAND_HAMMER_PGA_COUNTS, CAL_PI_LOCK_SAMPLES_HAMMER_PGA, CAL_PI_SETTLE_SAMPLES_HAMMER_PGA, CAL_PI_PLANT_SETTLE_SAMPLES_HAMMER_PGA, CAL_PI_TIMEOUT_SAMPLES_HAMMER_PGA, CAL_PI_REFINE_ENABLE_HAMMER_PGA, CAL_PI_REFINE_SETTLE_SAMPLES_HAMMER_PGA },
    { CAL_PI_KP_NUM_HAMMER_LP, CAL_PI_KP_DIV_HAMMER_LP, CAL_PI_KI_NUM_HAMMER_LP, CAL_PI_KI_DIV_HAMMER_LP, CAL_PI_GAIN_HAMMER_LP_X1000, CAL_PI_DEADBAND_HAMMER_LP_COUNTS, CAL_PI_LOCK_SAMPLES_HAMMER_LP, CAL_PI_SETTLE_SAMPLES_HAMMER_LP, CAL_PI_PLANT_SETTLE_SAMPLES_HAMMER_LP, CAL_PI_TIMEOUT_SAMPLES_HAMMER_LP, CAL_PI_REFINE_ENABLE_HAMMER_LP, CAL_PI_REFINE_SETTLE_SAMPLES_HAMMER_LP },
};
#endif

/* counts de ADC -> codigos de IDAC. Entero puro, en int64, y sin precalcular
 * el cociente: son 98,304 counts por codigo y redondear eso a 98 mete un error
 * sistematico del 0,3 % en todo el lazo. */
static int32 cal_counts_error_to_dac_scale(int32 error_counts)
{
    return cal_round_div_i64((int64)error_counts * (int64)CAL_COUNTS_PER_IDAC_CODE_DEN,
                             (int64)CAL_COUNTS_PER_IDAC_CODE_NUM);
}

