simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
/* Ganancia fisica de la etapa, referencia -> tap, x1000.
 *
 * La etapa 0 es la unica que NO tiene ganancia fija: su tap es la salida del
 * PGA de entrada, asi que lo que la referencia mueve alla escala con la
 * ganancia que tenga puesto el PGA. Medido en la placa: 57,7 / 108,7 / 220,2 /
 * 448,7 uV por codigo para 1x / 2x / 4x / 8x, o sea proporcional. Sin esto el
 * PI usaba la ganancia de 1x para todas y a 8x pedia un esfuerzo ocho veces
 * mayor que el necesario.
 *
 * Que la etapa 0 tenga la ganancia mas chica es justamente lo que la hace
 * calibrable con precision: 57,7 uV por codigo es el paso mas fino de las
 * cuatro etapas. */
static int32 cal_pi_stage_gain_x1000(uint8 stage_index)
{
    int32 configured_gain = g_cal_pi_cfg[stage_index].gain_x1000;

    if (stage_index == 0u && configured_gain > 0L) {
        int32 pga_gain_x1000 = (int32)psoc_hw_pga_gain_x1000();
        if (pga_gain_x1000 > 0L) {
            return cal_round_div_i64((int64)configured_gain * (int64)pga_gain_x1000,
                                     1000LL);
        }
    }
    return configured_gain;
}

static int32 cal_pi_deadband_counts(uint8 stage_index)
{
#ifdef CAL_PI_FORCE_MIN_DEADBAND
    (void)stage_index;
    return CAL_PI_DEADBAND_MIN_COUNTS;
#else
    int32 deadband = g_cal_pi_cfg[stage_index].deadband_counts;

#if PSOC_HW_CLASS == PSOC_HW_GEO
    if (stage_index == 0u) {
        uint16 gain_x1000 = psoc_hw_pga_gain_x1000();
        if (gain_x1000 >= 6000u) {
            deadband = CAL_PI_DEADBAND_GEO_PGA_8X_COUNTS;
        } else if (gain_x1000 >= 3000u) {
            deadband = CAL_PI_DEADBAND_GEO_PGA_4X_COUNTS;
        } else if (gain_x1000 >= 1500u) {
            deadband = CAL_PI_DEADBAND_GEO_PGA_2X_COUNTS;
        } else {
            deadband = CAL_PI_DEADBAND_GEO_PGA_1X_COUNTS;
        }
    }
#endif
    if (deadband < CAL_PI_DEADBAND_MIN_COUNTS) {
        deadband = CAL_PI_DEADBAND_MIN_COUNTS;
    }
    return deadband;
#endif
}

static int32 cal_pi_error_bucket(int32 error_counts, int32 deadband_counts)
{
    int32 abs_error;
    int32 span;
    int32 bucket;

    span = (deadband_counts <= 0L) ? 1L : deadband_counts;
    abs_error = abs_counts(error_counts);
    if (abs_error <= span) {
        return 0L;
    }
    bucket = 1L + ((abs_error - span - 1L) / span);
    return (error_counts < 0L) ? -bucket : bucket;
}

static uint8 cal_pi_measurement_valid(int32 measured)
{
    return (measured >= CAL_ADC_SIGNED_MIN_COUNTS &&
            measured <= CAL_ADC_SIGNED_MAX_COUNTS) ? 1u : 0u;
}

static uint8 cal_stage_measure_current(uint8 stage_index, int16 dac, int32 *measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[stage_index];

    ADC_Stop();
    CAL_AMUX_ADC_SELECT(stage->adc_channel);
    ADC_Start();
    stage->write(dac);
    CyDelay(CAL_DIAG_SWEEP_SETTLE_MS);
    if (measured != (int32 *)0) {
        *measured = cal_adc_read_direct_counts();
    }
    return 1u;
}

static uint8 cal_stage_value_in_tolerance(uint8 stage_index, int32 measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[stage_index];
    int32 control_sample = cal_pi_compare_counts(measured);
    int32 error_counts = stage->target_counts - control_sample;
    int32 deadband_counts = cal_pi_deadband_counts(stage_index);

    return (abs_counts(error_counts) <= deadband_counts &&
            cal_pi_measurement_valid(measured)) ? 1u : 0u;
}

static uint8 cal_verify_seeded_values(void)
{
    uint8 i;
    uint8 all_ok = 1u;

    cal_diag(PSOC_EVT_BOOT, PSOC_HW_CLASS);
    g_psoc_cal_result_count = PSOC_CAL_STAGE_COUNT;

    for (i = 0u; i < PSOC_CAL_STAGE_COUNT; i++) {
        const PsocCalStage *stage = &g_psoc_cal_stages[i];
        PsocCalResult *result = &g_psoc_cal_results[i];
        int16 dac = cal_stage_current_dac(i);
        int32 measured = 0L;
        uint8 ok;

        cal_diag(PSOC_EVT_CAL_STAGE_BEGIN, i);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_TARGET32, stage->target_counts);

        (void)cal_stage_measure_current(i, dac, &measured);
        ok = cal_stage_value_in_tolerance(i, measured);

        result->final_dac = dac;
        result->final_measured = measured;
        result->ok = ok;

        cal_diag(PSOC_EVT_CAL_STAGE_DAC, result->final_dac);
        cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, result->final_measured);
        cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, result->final_measured);
        cal_diag(PSOC_EVT_CAL_STAGE_OK, result->ok);

        if (!ok) {
            all_ok = 0u;
        }
    }

    psoc_calibration_restore_capture_path();
    return all_ok;
}

static int32 cal_pi_abs_error_counts(const PsocCalStage *stage, int32 measured)
{
    int32 control_sample = cal_pi_compare_counts(measured);
    return abs_counts(stage->target_counts - control_sample);
}

static int32 cal_pi_gain_scaled_term(int32 value, int32 num, int32 div, int32 gain_x1000)
{
    int32 sign = 1L;

    if (div == 0L) {
        div = 1L;
    }
    if (gain_x1000 < 0L) {
        sign = -1L;
        gain_x1000 = -gain_x1000;
    }
    if (gain_x1000 == 0L) {
        gain_x1000 = 1000L;
    }
    /* value permanece en counts hasta esta division. La version anterior lo
     * redondeaba primero a un codigo IDAC entero y recien despues dividia por
     * la ganancia: en GEO_PGA eso descartaba correcciones reales de varios
     * LSB del actuador. Esta expresion encadena counts->uV->IDAC->etapa en un
     * unico cociente int64 y conserva toda la resolucion. */
    return sign * cal_round_div_i64(
        (int64)value * (int64)num * (int64)CAL_ADC_SPAN_UV * 1000LL,
        (int64)div * (int64)CAL_ADC_LEVELS *
        (int64)CAL_IDAC_UV_PER_LSB * (int64)gain_x1000);
}

#if PSOC_HW_CLASS == PSOC_HW_GEO
/* Transferencia firmada Vref_LP -> tap, medida en la placa el 2026-09-03.
 * Los valores son delta-counts respecto del codigo cero. Se usa solamente la
 * pendiente de cuerda entre el seed y el esfuerzo candidato: el PI sigue
 * cerrando el lazo con la medida, pero deja de suponer que la ganancia es
 * constante cuando en la mitad negativa cambia por un factor 2,6. */
static const int16 g_cal_geo_lp_codes[] = {
    -255, -224, -192, -160, -128, -96, -64, 0,
      32,   64,   96,  128,  160, 192, 224, 255
};
static const int16 g_cal_geo_lp_delta_counts[] = {
    -13367, -12582, -10319, -7995, -5761, -3649, -1870, 0,
       930,   1813,   2706,  3578,  4424,  5279,  6132, 6367
};
#define CAL_GEO_LP_CURVE_POINTS \
    ((uint8)(sizeof(g_cal_geo_lp_codes) / sizeof(g_cal_geo_lp_codes[0])))

static int32 cal_pi_geo_lp_response_counts(int16 code)
{
    uint8 i;

    if (code <= g_cal_geo_lp_codes[0]) {
        return (int32)g_cal_geo_lp_delta_counts[0];
    }
    for (i = 1u; i < CAL_GEO_LP_CURVE_POINTS; i++) {
        int16 x1 = g_cal_geo_lp_codes[i];
        if (code <= x1) {
            int16 x0 = g_cal_geo_lp_codes[i - 1u];
            int32 y0 = (int32)g_cal_geo_lp_delta_counts[i - 1u];
            int32 y1 = (int32)g_cal_geo_lp_delta_counts[i];
            return y0 + cal_round_div_i64((int64)(code - x0) * (int64)(y1 - y0),
                                          (int64)(x1 - x0));
        }
    }
    return (int32)g_cal_geo_lp_delta_counts[CAL_GEO_LP_CURVE_POINTS - 1u];
}

static int32 cal_pi_geo_lp_chord_gain_x1000(int16 base_dac, int16 target_dac)
{
    int32 delta_counts;
    int32 delta_code;
    int32 gain;

