simplementeUnPorito/Tesis-firmware-psoc/AcondicionamientoAnalogico.cydsn/calibration.c
    if (target_dac == base_dac) {
        if (target_dac < PSOC_IDAC_SIGNED_MAX) {
            target_dac++;
        } else {
            target_dac--;
        }
    }
    delta_counts = cal_pi_geo_lp_response_counts(target_dac) -
                   cal_pi_geo_lp_response_counts(base_dac);
    delta_code = (int32)target_dac - (int32)base_dac;
    gain = abs_counts(cal_round_div_i64(
        (int64)delta_counts * (int64)CAL_ADC_SPAN_UV * 1000LL,
        (int64)delta_code * (int64)CAL_ADC_LEVELS *
        (int64)CAL_IDAC_UV_PER_LSB));
    if (gain < 200L) { gain = 200L; }
    if (gain > 850L) { gain = 850L; }
    return gain;
}
#endif

static int8 cal_pi_effort_delta_sign(int32 control_error, int8 direction, int32 gain_x1000)
{
    int8 sign;

    if (control_error == 0L || direction == 0 || gain_x1000 == 0L) {
        return 0;
    }

    sign = (control_error > 0L) ? 1 : -1;
    if (direction < 0) {
        sign = (int8)-sign;
    }
    if (gain_x1000 < 0L) {
        sign = (int8)-sign;
    }
    return sign;
}

static uint8 cal_pi_finalize_stage(uint8 ok, int16 final_dac, int32 final_measured)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    PsocCalResult *result = &g_psoc_cal_results[g_cal_async.stage_index];
    uint8 final_pass;

    final_dac = cal_stage_clamp_dac(stage, final_dac);
    stage->write(final_dac);
    result->final_dac = final_dac;
    result->final_measured = final_measured;
    result->ok = ok;
    final_pass = ((uint8)(g_cal_async.pass_index + 1u) >= (uint8)CAL_PI_PASS_COUNT) ? 1u : 0u;
    if (!ok && final_pass) {
        g_cal_async.ok = 0u;
    }

    cal_diag(PSOC_EVT_CAL_STAGE_DAC, result->final_dac);
    cal_diag_i16(PSOC_EVT_CAL_STAGE_MEAS, result->final_measured);
    cal_diag_i32(PSOC_EVT_CAL_STAGE_MEAS32, result->final_measured);
    cal_diag(PSOC_EVT_CAL_STAGE_OK, result->ok);

    g_cal_async.stage_index++;
    if (g_cal_async.stage_index >= PSOC_CAL_STAGE_COUNT) {
        if (!final_pass) {
            g_cal_async.pass_index++;
            g_cal_async.stage_index = 0u;
            g_cal_pi.state = CAL_PI_STAGE_BEGIN;
            return 0u;
        }
        cal_async_complete();
        return 1u;
    }
    g_cal_pi.state = CAL_PI_STAGE_BEGIN;
    return 0u;
}

/* Cierra la etapa con lo que el lazo ya tiene y agrega un unico refinamiento
 * de cuantizacion: probar el LSB que deberia reducir el error fisico; si no
 * mejora el error absoluto medido por el FIR, vuelve al DAC anterior. */
static uint8 cal_pi_finish_stage(uint8 ok)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    const PsocCalPiCfg *cfg = &g_cal_pi_cfg[g_cal_async.stage_index];
    int32 stage_gain_x1000;
    int32 control_sample;
    int32 error_counts;
    int8 step_sign;
    int16 dac_lo;
    int16 dac_hi;
    int16 trial_dac;

    if (!cfg->refine_enable || !ok || !cal_pi_measurement_valid(g_cal_pi.last_fir_output)) {
        return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
    }

    stage_gain_x1000 = cal_pi_stage_gain_x1000(g_cal_async.stage_index);
    if (stage_gain_x1000 == 0L) {
        return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
    }

    control_sample = cal_pi_compare_counts(g_cal_pi.last_fir_output);
    error_counts = stage->target_counts - control_sample;
    step_sign = cal_pi_effort_delta_sign(error_counts, stage->direction, stage_gain_x1000);
    if (step_sign == 0) {
        return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
    }

    dac_lo = cal_stage_min_dac(stage);
    dac_hi = cal_stage_max_dac(stage);
    if (step_sign > 0) {
        if (g_cal_pi.dac_current >= dac_hi) {
            return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
        }
        trial_dac = (int16)(g_cal_pi.dac_current + 1);
    } else {
        if (g_cal_pi.dac_current <= dac_lo) {
            return cal_pi_finalize_stage(ok, g_cal_pi.dac_current, g_cal_pi.last_fir_output);
        }
        trial_dac = (int16)(g_cal_pi.dac_current - 1);
    }

    g_cal_pi.refine_ok = ok;
    g_cal_pi.refine_base_dac = g_cal_pi.dac_current;
    g_cal_pi.refine_trial_dac = trial_dac;
    g_cal_pi.refine_base_measured = g_cal_pi.last_fir_output;
    g_cal_pi.refine_base_abs_error = cal_pi_abs_error_counts(stage, g_cal_pi.last_fir_output);
#if CAL_PI_USE_DIRECT_ADC
    g_cal_pi.settle_remaining = 1u;
#else
    g_cal_pi.settle_remaining = cfg->refine_settle_samples;
#endif
    g_cal_pi.empty_polls = 0UL;
    g_cal_pi.dac_current = trial_dac;
    stage->write(trial_dac);
    g_cal_pi.state = CAL_PI_REFINE_SETTLE;
    return 0u;
}

static void cal_pi_stage_begin(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    const PsocCalPiCfg *cfg = &g_cal_pi_cfg[g_cal_async.stage_index];
    int32 stage_gain_x1000;
    int32 deadband_counts;

#if CAL_PI_USE_DIRECT_ADC
    (void)cfg;
#endif

    cal_diag(PSOC_EVT_CAL_STAGE_BEGIN, g_cal_async.stage_index);
    cal_diag_i32(PSOC_EVT_CAL_STAGE_TARGET32, stage->target_counts);
    stage_gain_x1000 = cal_pi_stage_gain_x1000(g_cal_async.stage_index);
    deadband_counts = cal_pi_deadband_counts(g_cal_async.stage_index);
    cal_diag_i32(PSOC_EVT_CAL_PI_GAIN32, stage_gain_x1000);
    cal_diag(PSOC_EVT_CAL_PI_DEADBAND,
             (deadband_counts > 255L) ? 255u : (uint8)deadband_counts);

    g_cal_pi.integral = 0L;
    g_cal_pi.samples_taken = 0u;
    g_cal_pi.stable_count = 0u;
    g_cal_pi.have_last_error = 0u;
    g_cal_pi.last_error_dac = 0L;
    g_cal_pi.last_error_bucket = 0L;
    g_cal_pi.last_dac_target = 0u;
    g_cal_pi.last_fir_output = 0L;
    g_cal_pi.empty_polls = 0UL;
#if CAL_PI_USE_DIRECT_ADC
    /* Una lectura descartada despues de seleccionar AMux. Cada lectura
     * directa ya mantiene conversiones durante CAL_ADC_DIRECT_CONVERSION_MS. */
    g_cal_pi.settle_remaining = 1u;
#else
    g_cal_pi.settle_remaining = cfg->settle_samples + cfg->plant_settle_samples;
#endif
    g_cal_pi.control_hold_remaining = 0u;
    g_cal_pi.refine_base_measured = 0L;
    g_cal_pi.refine_base_abs_error = 0L;
    g_cal_pi.refine_base_dac = 0u;
    g_cal_pi.refine_trial_dac = 0u;
    g_cal_pi.refine_ok = 0u;
    g_cal_pi.base_dac = cal_stage_current_dac(g_cal_async.stage_index);
    g_cal_pi.dac_current = g_cal_pi.base_dac;
    stage->write(g_cal_pi.dac_current);

    ADC_Stop();
    CAL_AMUX_ADC_SELECT_STAGE(stage->adc_channel);
    cal_diag(PSOC_EVT_CAL_AMUX_IN, stage->adc_channel);
#if CAL_AMUX_HAS_CAP_CHANNEL
    cal_diag(PSOC_EVT_CAL_AMUX_CAP, CAL_AMUX_CAP_CHANNEL);
#endif
    ADC_Start();

    stage->write(g_cal_pi.dac_current);

    /* Al cambiar de AMux, la linea de retardo contiene otra etapa. Borrarla
     * permite que el settle sea exactamente la longitud del FIR, no un margen
     * empirico de 512 muestras. */
    psoc_filter_reset_history();

    /* El PI no promedia/EMA en software: extrae el DC con el FIR de hardware
     * (Canal A del Filter, coeficientes de FIR_calibration.h cargados en
     * cal_pi_start) -- ADC -> Filter_STAGEA -> DMA_Filter_RAM, leido muestra
     * a muestra en cal_pi_run_service. */
#if CAL_PI_USE_DIRECT_ADC
    dma_route_select(0u);
#else
    dma_route_select(1u);
#endif
    psoc_filter_reset_history();
    psoc_adc_clear_isr_filtered_sample();
#ifdef CY_ISR_isr_DMA_Filter_RAM_H
    isr_DMA_Filter_RAM_ClearPending();
#endif
    ADC_StartConvert();

    g_cal_pi.state = (g_cal_pi.settle_remaining == 0u) ? CAL_PI_RUN : CAL_PI_SETTLE;
}

static uint8 cal_pi_settle_service(void)
{
    int32 sample;

    if (!cal_pi_take_control_sample(&sample)) {
        g_cal_pi.empty_polls++;
        if (g_cal_pi.empty_polls >= CAL_ASYNC_EMPTY_POLL_LIMIT) {
            return cal_pi_finish_stage(0u);
        }
        return 0u;
    }

    g_cal_pi.empty_polls = 0UL;
    g_cal_pi.last_fir_output = sample;

    if (g_cal_pi.settle_remaining > 0u) {
        g_cal_pi.settle_remaining--;
    }
    if (g_cal_pi.settle_remaining == 0u) {
        g_cal_pi.integral = 0L;
        g_cal_pi.samples_taken = 0u;
        g_cal_pi.stable_count = 0u;
        g_cal_pi.have_last_error = 0u;
        g_cal_pi.last_error_dac = 0L;
        g_cal_pi.last_error_bucket = 0L;
        g_cal_pi.empty_polls = 0UL;
        g_cal_pi.state = CAL_PI_RUN;
    }

    return 0u;
}

static uint8 cal_pi_refine_service(void)
{
    const PsocCalStage *stage = &g_psoc_cal_stages[g_cal_async.stage_index];
    int32 sample;
    int32 trial_abs_error;

    if (!cal_pi_take_control_sample(&sample)) {
        g_cal_pi.empty_polls++;
        if (g_cal_pi.empty_polls >= CAL_ASYNC_EMPTY_POLL_LIMIT) {
            stage->write(g_cal_pi.refine_base_dac);
            g_cal_pi.dac_current = g_cal_pi.refine_base_dac;
            g_cal_pi.last_fir_output = g_cal_pi.refine_base_measured;
            return cal_pi_finalize_stage(g_cal_pi.refine_ok,
                                         g_cal_pi.refine_base_dac,
                                         g_cal_pi.refine_base_measured);
        }
        return 0u;
    }

    g_cal_pi.empty_polls = 0UL;
    g_cal_pi.last_fir_output = sample;

    if (g_cal_pi.settle_remaining > 0u) {
        g_cal_pi.settle_remaining--;
    }
    if (g_cal_pi.settle_remaining != 0u) {
        return 0u;
    }

    trial_abs_error = cal_pi_abs_error_counts(stage, sample);
    if (trial_abs_error < g_cal_pi.refine_base_abs_error &&
        cal_pi_measurement_valid(sample)) {
        g_cal_pi.dac_current = g_cal_pi.refine_trial_dac;
        return cal_pi_finalize_stage(g_cal_pi.refine_ok,
                                     g_cal_pi.refine_trial_dac,
                                     sample);
    }

    stage->write(g_cal_pi.refine_base_dac);
    g_cal_pi.dac_current = g_cal_pi.refine_base_dac;
    g_cal_pi.last_fir_output = g_cal_pi.refine_base_measured;
    return cal_pi_finalize_stage(g_cal_pi.refine_ok,
                                 g_cal_pi.refine_base_dac,
                                 g_cal_pi.refine_base_measured);
}

